from enum import Enum, unique
from copy import deepcopy

'''
    NT组份构成类别 types:
        NS 行政区划 - 北京市/北京/黑龙江省/黑龙江/哈尔滨香坊区/(香港)/(南京)
        NA 字号弱化 - 新玖/酒矿
        NN 字号名称 - 国联/华为/新中新/海能达
        NH 字号强化 - 中交/中建
        NU 编号序号 - 第一/十五号
        NZ 行业特征 - 科技/技术/信息/门业/机械
        NM 标准机构 - 公司/有限公司/有限责任公司/俱乐部/委员会/办公室
        NO 单字机构 - 厂/处/院/馆/场/宫/店
           单字分支 - 中山路/大王村/第二/三十五
        NB 分支机构 - 分公司/分店/分厂
        NL 后置冠字 - (普通合伙)/(有限公司)/(特殊合伙)/(有限责任公司)/(协会)
    常见NT构成组份词表 nt_tails
'''


class types:
    '''根据常用尾缀进行NT行业类型划分'''

    NX = ('NX', 130)  # 专用于指代未知类型

    # NT组份类别优先级
    NA = ('NA', 132)  # 弱化名称(地名中含有NO单字尾缀的名称)
    NN = ('NN', 133)  # 名称字号
    NU = ('NU', 134)  # 数字序数

    NS = ('NS', 146)  # 地区地标
    NS1 = ('NS1', 145)  # 省/自治区/直辖市
    NS2 = ('NS2', 144)  # 地级市/州/盟
    NS3 = ('NS3', 143)  # 区/县/旗 (地区/开发区/景区)
    NS4 = ('NS4', 142)  # 乡镇/街道/苏木 (园区/工业园/度假区)
    NS5 = ('NS5', 141)  # 村屯/社区/嘎查/农场/林场/牧场/渔场 (公园/游乐园)
    NS6 = ('NS6', 140)  # 院区/北区

    NH = ('NH', 149)  # 特殊占位
    NZ = ('NZ', 150)  # 专业词汇
    NO = ('NO', 151)  # 单字尾缀
    NL = ('NL', 153)  # 后置冠字
    NM = ('NM', 154)  # 组织特征
    NB = ('NB', 155)  # 分支机构

    # 对常见的组份类型进行组合定义,便于统一使用
    tags_NX = {NX}  # 未识别段
    tags_NA = {NA}  # 弱化名字
    tags_NO = {NO}  # 单独尾字
    tags_NN = {NN}  # 名称字号

    tags_NZ = {NZ}  # 专业名词
    tags_NU = {NU}  # 数字序号
    tags_NL = {NL}  # 尾缀
    tags_NM = {NM}  # 组织机构
    tags_NB = {NB}  # 分支机构
    tags_NH = {NH}  # 特殊占位

    tags_NS = {NS}  # 地域名称
    tags_NS1 = {NS, NS1}
    tags_NS2 = {NS, NS2}
    tags_NS3 = {NS, NS3}
    tags_NS4 = {NS, NS4}
    tags_NS5 = {NS, NS5}
    tags_NS6 = {NS, NS6}

    _maps = None  # 用于记录数值到类型的映射
    _itms = set()  # 用于记录所有的条目值

    @staticmethod
    def _init_():
        for k in types.__dict__.keys():
            if k[0] == '_':
                continue
            v = getattr(types, k)
            if not isinstance(v, tuple) or len(v) != 2:
                continue
            types._itms.add(v)

        types._maps = {
            types.NA[1]: types.NA, types.NO[1]: types.NO, types.NN[1]: types.NN, types.NZ[1]: types.NZ, types.NU[1]: types.NU,
            types.NS[1]: types.NS, types.NS1[1]: types.NS, types.NS2[1]: types.NS, types.NS3[1]: types.NS, types.NS4[1]: types.NS, types.NS5[1]: types.NS, types.NS6[1]: types.NS,
            types.NM[1]: types.NM, types.NB[1]: types.NB, types.NL[1]: types.NL, types.NH[1]: types.NH, types.NX[1]: types.NX,
        }

    @staticmethod
    def is_types(val):
        """判断val是否为types.XX类型"""
        return val in types._itms

    @staticmethod
    def type(val):
        """对组份类型进行归一化处理"""
        if val.__class__ is set:
            it = iter(val)
            _, v = next(it)
            for _, n in it:
                if n > v:
                    v = n
            return types._maps[v]
        else:
            return types._maps[val[1]]

    @staticmethod
    def tag(val):
        """获取NT组份类型的单字母描述标记,如NM=>'M',NZ=>'Z'"""
        return types.type(val)[0][1]

    @staticmethod
    def equ(v, t):
        """判断给定的值类型v是否等同于目标类型t(多类型时按最大值判断)."""
        if v == t:
            return True
        a = types.type(v)
        b = types.type(t)
        return a[1] == b[1]

    @staticmethod
    def cmp(v, t):
        """比较给定的值类型v与目标类型t的关系(类型为多值集合时按最大值判断).
            返回值:
             -1 - v 小于 t
              0 - v 等于 t
              1 - v 大于 t
        """
        if v == t:
            return 0
        a = types.type(v)
        b = types.type(t)
        if a[1] == b[1]:
            return 0
        return -1 if a[1] < b[1] else 1


# types类型内部初始化
types._init_()

# 常见NT组织形式尾缀数据表
nt_tails = {
    # 工矿企业
    '分店': {'.': types.tags_NB, '-': {},
             '+': {'分号', '分厂', '分矿', '分校', '分团', '分公司', '子公司', '分工厂', '分司', '分工司', '支公司', '分部', '经营分部', '分局', '分院', '分所', '直属分局', '支局', '分园', '子厂', '分场',
                   '分社', '工会分会', '分会所', '分站', "分会", "子站", "分队", "分处", '分台', '(分)局', '名胜区分公司', '新机场分公司', '机场分公司', '林场分公司', '牧场分公司', '农牧场分公司', '子分庄',
                   '畜牧场分公司', '火车站分公司', '火车站分社', '分馆', '分工场', '分药店', '分诊所', '分病区', '分门诊', '中心分社', '中心支局', '中心支公司', '支校', '分校园', '分(院)', '分市场', '小分队',
                   '支中心', '分中心', '有限分公司', '酒店分公司', '大酒店分公司', '分院区', '分药房', '分苗圃', '分行', '分车库', '大队', '分校区', '茶庄分庄'}},

    '工厂': {'.': types.tags_NM, '-': {},
             '+': {'加工厂', '化工厂', '净水厂', '纯水厂', '电线厂', '配件厂', '建材厂', '修理厂', '汽修厂', '维修厂', '开关厂', '家具厂', "服饰厂", "冶选厂", "分选厂", "生产厂", "机修厂", "冷冻厂", "雕刻厂",
                   '工具厂', '模具厂', '玩具厂', '预制厂', '彩印厂', '制品厂', '用品厂', '艺品厂', '食品厂', '塑料厂', '材料厂', "标牌厂", "玻璃厂", "选矿厂", "再选厂", "肥料厂",
                   '涂料厂', '石料厂', '机械厂', '水泥厂', '处理厂', '工艺厂', '制衣厂', '包装厂', '服装厂', '修造厂', '制造厂', '铸造厂', '修配厂', '五金厂', "实验厂", '选煤厂', '采油厂',
                   "大修厂", "家俱厂", "灯具厂", "皮具厂", "福利厂", "箱包厂", "综合厂", "纸品厂", "木器厂", "屠宰厂", "饮料厂", "饲料厂", "结构厂", "冶炼厂", '工加厂', '分车间', '百货厂', '石灰厂', '毛纺厂',
                   "焦化厂", "沙发厂", "绣品厂", "饰品厂", "手套厂", "卷烟厂", "家私厂", "轮窑厂", "弹簧厂", "毛衫厂", "织造厂", "锻造厂", "合金厂", "电镀厂", "灯饰厂", '窗纱厂', '火柴厂', '制作厂', "轴承厂",
                   "维护厂", "辅料厂", "设施厂", "电杆厂", "器械厂", "医疗器械厂", '汽车修理厂', "羊毛衫厂", "变压器厂", '自来水厂', '纯净水厂', '总厂',
                   }},
    '电厂': {'.': types.tags_NM, '-': {},
             '+': {'发电厂', '电站', '发电站', '水电站', '核电站', '供电局', '供电所', "风电场", '中心供电所'}},
    '公司': {'.': types.tags_NM, '-': {},
             '+': {'总公司', '有限公司', '有限责任公司', '责任公司', '股份公司', '集团公司', '集团总公司', '服务公司', '工程公司', '股份有限公司', '有限责任工司', '株式会社', '两合公司', '有限总公司', '总部',
                   '大药房有限公司', '农工商联合公司', '农工商公司', '农工商总公司', '酒店管理有限公司', '饭店管理有限公司', '旅行社有限公司', '设计院有限公司', '研究院有限公司', '医院有限公司', '劳动服务公司',
                   '服务区有限公司', '银行股份有限公司', '.LTD', '劳司', '发展公司', '(集团)有限公司'}},
    '中心': {'.': types.tags_NM, '-': {},
             '+': {'服务中心', '管理中心', '培训中心', '运动中心', '旅游开发管理中心', '行政事务管理中心', '安置中心', '副中心', '总中心'}},
    '煤矿': {'.': types.tags_NO, '-': {'探矿', '洗矿', '矿长', '矿产'},
             '+': {'金矿', '铁矿', '气矿', '盐矿', '石矿', '砂矿', '硅矿', '钙矿', '钛矿', '钨矿', '铅矿', '钼矿', '铀矿', '铜矿', '铝矿', '锡矿', '硫铁矿', '镍矿', '镁矿',
                   '锌矿', '锰矿', '联营矿', '金属矿', '原料矿', '有色矿', '露天矿', '磷矿', '硝矿', '碱矿', '钾矿', '汞矿', '沙矿', '矾矿', '硼矿', '磺矿', '钒矿', '银矿', '锑矿'}, },
    '工坊': {'.': types.tags_NO, '-': {},
             '+': {'油坊', '磨坊', '酒坊', "作坊", '工场', '联盟', '粉厂', '车厂', '酒厂', '钢厂', '铁厂', '门厂', '鞋厂', '炉厂', '煤厂', '瓦厂', '瓷厂', '石厂', '砖厂', '管厂', '箱厂', '纸厂', "柜厂",
                   '织厂', '肥厂', '胶厂', '船厂', '茶厂', '药厂', '表厂', '布厂', '床厂', '机厂', '件厂', '材厂', '板厂', '水厂', '油厂', '泵厂', "球厂", "纺厂", '车间', "木厂", "架厂", "轮厂",
                   "漆厂", "丝厂", "气厂", "灰厂", "矿厂", "砂厂", "米厂", "线厂", "网厂", "袋厂", "选厂", "锌厂", '盐厂', "窑厂", "灯厂", "烟厂", "香厂", "垫厂", '工区', '梁场', '沙场', '煤场', '盐场',
                   '石场', '砂场', "料场", "烘焙坊",  # '剂厂',
                   }},
    '加工场': {'.': types.tags_NM, '-': {},
               '+': {'总场', '屠宰场', '制梁场', '采石场', '停车场', '停车埸', '洗车场', '加工埸', "预制场", '拆解场', '存车场', '拆车场', '试验场', '洗车坊'}},
    '基地': {'.': types.tags_NM, '-': {},
             '+': {'训练基地', '活动营地', '露营地', '单车营', '大本营', '应急营', '成长营', '服务营', '渡假营', '训练营'}},
    '普通合伙': {'.': types.tags_NM, '-': {'合伙人'},
                 '+': {'有限合伙', '合伙企业', '有限合伙企业'}},
    '行业联盟': {'.': types.tags_NM, '-': {},
                 '+': {'产业技术联盟', '产业联盟', '公益联盟', '创业联盟', '创新战略联盟', '创新联盟', '剧院联盟', '博物馆联盟', '发展联盟', '合作联盟', '图书馆联盟', '幸福联盟',
                       '志愿者联盟', '战略联盟', '技术创新战略联盟', '技术创新联盟', '技术联盟', '投资联盟', '教育联盟', '旅游联盟', '智库联盟', '服务联盟', '爱心联盟', '贸易联盟',
                       '阳光志愿者联盟', '国际联盟', '产学研资联盟', '采购联盟', '认证联盟', '建设联盟', '培训联盟', '演艺联盟', '孝老联盟', '网络联盟', '组织联盟', '应用联盟',
                       '品牌联盟', '产权联盟', '文旅联盟', '开放联盟', '党建联盟', '义工联盟', '家居联盟', '企业家联盟', '创客联盟', '基地联盟', '生态圈联盟', '互助联盟', '电子商务联盟',
                       '众创联盟', '振兴联盟', '办公联盟', '新媒体联盟', '评价联盟', '企业联盟', '(企业)联盟'}},

    '砖窑': {'.': types.tags_NO, '-': {},
             '+': {'瓦窑', '石灰窑', '砖瓦窑', '灰窑', '焖窑', '煤窑'}},
    '回收站': {'.': types.tags_NO, '-': {},
               '+': {'回收拆解站', '回收处', '回收厂', '回收点', '回收行', '回收中心', '回收部', '回收利用部', '回收利用站', '回收店', '回收队', '回收专点',
                     '物质回收站', '资源回收站', '物资回收站', '再生资源回收站', '收购站', '废品收购站', '废品回收场', '废旧品回收场', '回收场'}},
    # 政府司法
    '法院': {'.': types.tags_NM, '-': {},
             '+': {'仲裁庭', '审判庭', '法庭', '人民法院', '中级人民法院', '高级人民法院', '检察院', '仲裁院', '争议仲裁院', '执行庭'}},
    '司法局': {'.': types.tags_NM, '-': {},
               '+': {'公安局', '审计局', '监察局', '公安厅', '派出所', '看守所', '司法所', '司法办公室', '戒毒所', '鉴定所', '司法鉴定所', '监狱', "拘留所", '强制隔离戒毒所', '强制戒毒所',
                     '劳动教养管理所'}},
    '支队': {'.': types.tags_NM, '-': {},
             '+': {'地质大队', '调查大队', '边防支队', '消防支队', '改造支队', '管教支队', '劳改支队', '监管支队', '管理支队', '综合大队', '钻井大队', '物探大队', '保障支队', '海防支队', '巡逻支队',
                   '交通支队', '公路支队', '巡特警支队', '特警支队', '刑警支队', '协警支队', '交巡警支队', '训练支队', '航空支队', '监督支队', '执法支队', '禁毒支队', '稽查支队', '检查支队', '侦查支队',
                   '路政支队', '救援支队', '直属支队', '警察支队', '督察支队', '监察支队', '侦察支队', '保卫支队', '警务支队', '勤务支队', '机动支队', '法制支队', '联防大队', '消防大队', '巡防大队',
                   '巡逻大队', '交通大队', '公路大队', '特警大队', '法警大队', '巡警大队', '监督大队', '禁毒大队', '稽查大队', '巡查大队', '侦查大队', '救援大队', '管护大队', '救护大队', '保护大队',
                   '直属大队', '警察大队', '监察大队', '救护中队', '矿山救护中队', '监察中队', '特勤支队', '武警支队', '交通警察支队', '交警支队', '交通警察大队', '执法大队', '工程大队', '测绘大队',
                   '交警大队', '城监大队', '消防大队', '执法中队', '管理大队', '水政监察大队', '渔政监督大队', '总支队'}},
    '海关': {'.': types.tags_NM, '-': {'关于'},
             '+': {"商务部", }},
    '办公厅': {'.': types.tags_NM, '-': {},
               '+': {'合作厅', '财政厅', '自然资源厅', '自然资源和规划厅', '经济和信息化厅', '管理厅', '科技厅', '科学技术厅', '监督管理厅', '政府办公厅', '生态环境厅', '环境生态厅', '环境保护厅', '环保厅',
                     '渔业厅', '海洋与渔业厅', '水利厅', '民政厅', '文化和旅游厅', '出版厅', '文化厅', '文化传播厅', '教育厅', '建设厅', '应急管理厅', '体育厅', '工业和信息化厅', '审计厅', '国土资源厅', '司法厅',
                     '农牧业厅', '农牧厅', '农业厅', '农业农村厅', '信息产业厅', '保障厅', '住房和城乡建设厅', '交通运输厅', '交通厅'}},
    '办公室': {'.': types.tags_NM, '-': {},
               '+': {'管理办', '项目办', '研究室', '教学研究室', '政策研究室', '工作办', '法制办', '开发办', '综合开发办', '政府办', '接待办', '建设管理办', '领导小组办', '建设办', '政府办公室', '小组办公室',
                     '信访办公室', '管理办公室', '项目办公室', '工作办公室', '法制办公室', '开发办公室', '综合开发办公室', '接待办公室', '建设管理办公室', '领导小组办公室'}},
    # 学校
    '幼儿园': {'.': types.tags_NM, '-': {},
               '+': {'幼稚园', '机关幼儿园', '附属幼儿园', '中心幼儿园', '午托所', '午托班', '幼儿班', '托管班', '托育班', '看护班', }},
    '培训班': {'.': types.tags_NM, '-': {},
               '+': {'委托班', '教学班', '补习班', '训练班', '辅导班', "讲师团", }},
    '学校': {'.': types.tags_NM, '-': {'学业'},
             '+': {'小学', '中学', '高中', '职业高中', '总校', '中学校', '中心学校', '职业中学', '附属中学', '中心中学', '二校区', '中心校区', '中心初中', '中心总校', '中心完小', '中心初级中学',
                   '民族中学', '初级中学', '高级中学', '职业高级中学', '实验中学', '完全小学', '附属小学', '中心小学', '民族小学', '实验小学', '初级中学校', '中心完全小学', '高级中学校', '进修学校', '实验学校',
                   '实验初中', '附属初中', }},
    '校区': {'.': types.tags_NO, '-': {},
             '+': {'东校区', '南校区', '西校区', '北校区', '新校区', '小学部', '初中部', '高中部', '附小', '完小', '联小', '中心小学校', '实验小学校', '小学校', '武校', '盲校', '网校', '聋校', '联校', '公学',
                   '小学东校', '小学西校', '小学南校', '小学北校', '中学东校', '中学西校', '中学南校', '中学北校', '学校东校', '学校西校', '学校南校', '学校北校', '中心校', '学区', '基地校', '初中校', '高中校',
                   '小学东校区', '小学西校区', '小学南校区', '小学北校区', '中学东校区', '中学西校区', '中学南校区', '中学北校区', '学校东校区', '学校西校区', '学校南校区', '学校北校区', '学园', '师范附小', '初中', }},
    '职校': {'.': types.tags_NM, '-': {},
             '+': {'艺校', '驾校', '进修校', '体校', '技校', '鼓校', '业校', '中专', '职业中专', '卫校', '农校', '农广校', '农机校', '联合校', '技工学校', '技术学校', '职业中学校',
                   '培训学校', '中专学校', '工业学校', '老年大学', '党校', '团校', '专科学校', '干部学校', '职业中专校', '医专', '行政管理学校', }},
    '大学': {'.': types.tags_NM,
             '-': {'大学生', '大学城', '大学路', '大学东路', '大学西路', '大学士', '大学南路', '大学北路', '大学中专', '大学街', '大学仕', '大学塘'},
             '+': {'科技大学', '师范大学', '中医药大学', '电视大学', '交通大学', '医科大学', '理工大学', '师范学校', '外国语学校', '职业学院', '佛学院', '农学院', '医学院',
                   '商学院', '工学院', '技术学院', '工程大学', '林学院', '理学院', '工程学院', '教育学院', '师范学院', '培训学院', '学院', '军校', '夜大学'}},

    # 协会委会
    '协会': {'.': types.tags_NO, '-': {},
             '+': {'企业协会', '行业协会', '服务协会', '警察协会', '老年协会', '技术协会', '科学技术协会', '管理协会', '教育学会', '图书馆学会', '总会', '交流协会', '银行业协会',
                   '志愿者协会', '用水者协会', '体育协会', '计划生育协会', '研究会', '联谊会', '促进会', '职工技协', "持股会", '眼镜行业协会',
                   "职工持股会", '(协)会', '经销行业协会', '保险行业协会', '皮革行业协会', '粮食行业协会', '餐饮行业协会', '装饰行业协会'}, '-': {'协助', '协调'}},
    '联合会': {'.': types.tags_NO, '-': {},
               '+': {'残疾人联合会', '妇女联合会', '残联', '妇联', '文联', '体协', '技协', '消协', '社科联', '公会', '联合公会', '同业公会', '乡贤参事会', '乡贤会', '禁毒禁赌会', '联盟会'}},
    '委员会': {'.': types.tags_NO, '-': {},
               '+': {'工会委员会', '工作委员会', '管理委员会', '常委会', '人大常委会', '管委会', '组委会', '工作委', '常务委', '政法委', '管理委', '卫健委', '发改委', '工会委', '文化委', '文卫委', '旅发委',
                     '纪工委', '纪检委', '计生委', '生态管理委员会', '建设管理委员会', '筹委会', '监事会', '中心委员会', '中心委', }},
    '省委': {'.': types.tags_NO, '-': {},
             '+': {'人民政府', '政府', '政协', '市委', '区委', '县委', '旗委', '州委', '村委', '工委', '建委', '教委', '纪委', '党委', '团委', '地委', '委会', '盟委', '居委', '校友会', '商会', '学会', }},
    '居委会': {'.': types.tags_NM, '-': {},
               '+': {'居民委', '居民委员会', '居民居委会', '民居委员会', '居民委会', '治理委员会', '居民事务中心', '街民委员会', '居民管理委员会', '家委会', '街道委员会',
                     '街道办事处', '办事处', '街道办', '中心街道', '类似居委会', '商务公寓工作站', '民主议事会', '居民议事会', '社区工作站', "团场"}},
    '村委会': {'.': types.tags_NM, '-': {},
               '+': {'联合村委会', '村民委员会', '村民委会', '村民委', '村民小组', '村名委员会', '村委员会', '村民村委员会', '直辖村民小组', '渔委会', '牧委会', '嘎查委会', '嘎查人民委员会', '嘎查委员会', '牧民委员会',
                     '村民议事会'}},
    '十字会': {'.': types.tags_NM, '-': {},
               '+': {'红十字会', '红十会'}},
    '工会': {'.': types.tags_NM, '-': {},
             '+': {'机关工会', '分工会', '总工会', '教育工会', "工会小组", "联合工会"}},
    '董事会': {'.': types.tags_NM, '-': {},
               '+': {'校董会'}},
    # 金融机构
    '储蓄所': {'.': types.tags_NO, '-': {},
               '+': {'火车站储蓄所', '分理处', '火车站分理处', }},
    '银行': {'.': types.tags_NM, '-': {'行走', '行为'},
             '+': {'总行', '商业银行', '农村商业银行', '农村合作银行', '工商银行', '邮政储蓄银行', '村镇银行', '信用联社', '农村信用联社', '中心信用社', '信用社', '基金会', '发展基金会', '教育基金会'}},
    '支行': {'.': types.tags_NB, '-': {},
             '+': {'中心支行', '大学支行', '广场支行', '小微支行', '火车站支行', }},
    # 供销合作
    '服务社': {'.': types.tags_NM, '-': {},
               '+': {'会社', '军人服务社', '综合服务社', '互助社', '服务所', '科技社', "理事会", "红白理事会", "中介所", "介绍所", "职业介绍所", }},
    '合作社': {'.': types.tags_NM, '-': {},
               '+': {'综合社', '联合社', '经济联合社', '合作社联合社', '专业合作社联合社', '供销合作社联合社', '合作社联社', '联社', '合作联社', '专业合作联社', '信用合作联社', '农村信用合作联社', '经济社', '合作经济社',
                     '专业合作社', '股份合作社', '互助合作社', '经济合作社', '信用合作社', '供销合作社', '经营所', '中心供销合作社'}},
    '营业部': {'.': types.tags_NO, '-': {},
               '+': {'供销社', '经销社', '经营部', '经销部', '营销部', '购销部', '销售部', '零售部', '租赁站', '购销站', '门市部', '销售处', '售票处', '经销处', '总经销', '中心供销社', '中心售票处', '火车站营业部',
                     '火车站门市部', }},
    '销部': {'.': types.tags_NO, '-': {},
             '+': {'经部', '配部', '总汇', }},

    '联合体': {'.': types.tags_NO, '-': {'体育', '体操'},
               '+': {'联营体', '共同体', '医共体', }},
    # 科研院所
    '研究院': {'.': types.tags_NM, '-': {},
               '+': {'科学研究院', '科技研究院', '设计研究院', '测绘院', '研究总院', '设计研究总院', '总院', '设计院', '规划设计院', '勘察设计院', '工程设计院',
                     '建筑设计院', '勘察院', '科学院', '城建院', '社科院', '管理院', "规划院", "勘查院", "考试院", '勘査院', '大学研究院'}},
    '研究所': {'.': types.tags_NM, '-': {},
               '+': {'设计所', '检验所', '药品检验所', '检测所', '防治所', '科学研究所', '设计研究所', '监督所', '卫生监督所'}},
    '监测台': {'.': types.tags_NM, '-': {},
               '+': {'地震台', '基准台', '天文台', '实验台', '寻呼台', '信息台', '信息台', '查询台', '气象台', '海洋预报台', '观象台', '预报台', '通信台'}},

    # 医疗福利
    '福利院': {'.': types.tags_NM, '-': {},
               '+': {'护理院', '敬老院', '养老院', '社会福利院', '农村福利院', '儿童福利院', '保育院', "互助会", "慈善会", "光荣院", '福利会', '救助会', '中心敬老院'}},
    '殡仪馆': {'.': types.tags_NM, '-': {},
               '+': {'陵园', '公墓', '安息园', '火葬场', '寝园', '骨灰林', '塔陵', '安息陵', '墓区', }},

    '医院': {'.': types.tags_NM, '-': {},
             '+': {'中医院', '妇产医院', '中医医院', '康复医院', '附属医院', '职工医院', '中心医院', '总医院', '人民医院', '动物医院', '宠物医院', '精神病医院',
                   '专科医院', '眼科医院', '骨科医院', '口腔医院', '医院新院', '脑科医院', '眼科医院', }},
    '医药商店': {'.': types.tags_NM, '-': {},
                 '+': {'药品超市', '医药量贩', '医药市场', }},
    '门诊部': {'.': types.tags_NO, '-': {},
               '+': {'药店', '口腔门诊部', '卫生室', '药号', '药房', '大药房', '药铺', '药行', '药材行', '药材站', '药材栈', '药庄', '药妆店', '药品部', '药品店', '药具站', '中心血库', '血库', "血站",
                     '草药部', '草药站', '膏药老店', '老药铺', '老膏药铺', '膏药铺', '新特药部', '药部', '大药店', '大药行', '国药馆', '医药馆', '医药部', '医药行', '中心卫生院', '中心血站', '疗养院',
                     '医药站', '医药店', '中药馆', '中西药行', '中药饮片部', '中药部', '中药配方部', '中药行', '国药号', '中药材部', '中草药馆', '中草药行', '中药铺', '美容院', '卫生院', "医务室", '连锁门诊部',
                     '药品行', '藥號', '中心药房', '中心大药房', '中心药店', '连锁药店', '连锁药房', '连锁大药房', '药品站', '中医堂', '中医所', '卫生所', '门诊', '诊所', '蒙医院', '藏医院', '妇幼保健院',
                     '中医诊所', '口腔门诊', '保健院', "防治院", '医院东院', '医院南院', '医院西院', '医院北院', '医院东院区', '医院南院区', '医院西院区', '医院北院区',
                     }},
    # 文化娱乐
    '影剧院': {'.': types.tags_NO, '-': {},
               '+': {'剧院', '影院', '影都', '大剧院', '电影院', '歌剧院', '剧团', '曲剧团', '影城', '电影城', '艺术团', '乌兰牧骑', '影埸', "录像厅", "舞团", "歌舞团", "乐团", "合唱团", '话剧院'}},
    '书画院': {'.': types.tags_NO, '-': {},
               '+': {'书法院', '品味轩', '文印轩', "美术社", }},
    '画院': {'.': types.tags_NO, '-': {},
             '+': {'书院', '书肆', '书馆', '画廊', '书房', '书轩', '墨轩', '瓷轩', '画轩', '石轩', "书社", '书舍', '画舍', }},
    '博物馆': {'.': types.tags_NO, '-': {},
               '+': {'文化馆', '科技馆', '纪念馆', '美术馆', '艺术馆', '档案馆', '图书馆', '教育馆', '体验馆', '科普馆', "娱乐厅", "展厅", "展览馆", "文献馆"}},
    '文化宫': {'.': types.tags_NO, '-': {},
               '+': {'工人文化宫', '少年宫', '青少年宫', '体育馆', '球馆', '体育场', '溜冰埸', '旱冰场', '滑冰场', '冰球馆', '冰球场'}},
    '出版社': {'.': types.tags_NM, '-': {},
               '+': {'杂志社', '报社', '日报社', '音像出版社', '总社'}},
    '文印社': {'.': types.tags_NO, '-': {},
               '+': {'印社', '打字复印社', '打印社', '复印社', '复印店', '印务部', '复印部', '文印部', "制作室", "文印室", "文印店", "摄影店", "图文店", "印务社", "刻字社",
                     "图文社", "图片社", "快印店", "图文快印店", "打印店", '照相馆', '相馆', "像馆", "照像馆", "影楼", "印刷部", "快印部", "美术部", "工艺部", }},
    '信息港': {'.': types.tags_NO, '-': {},
               '+': {'网络会所', '网咖店', '数码港'}},
    '电视台': {'.': types.tags_NM, '-': {},
               '+': {'电视站', '广播电视站', '广播电视台', '广播电台', '中波台', '交换台', '传呼台', '传输台', '传输总台', '发射台', '发射总台', '差转台',
                     '广播影视台', '广播电视总台', '录转台', '微波台', '收转台', '电台', '电视录转台', '电视总台', '电视收转台', '电视监测台', '调频台', '转播台', }},

    # 食品餐饮
    '饭店': {'.': types.tags_NO, '-': {},
             '+': {'酒楼', '餐饮店', '冷饮店', '大酒楼', '大饭店', '大酒家', '食堂', '大食堂', '职工食堂', '餐厅', '烧烤广场', '啤酒广场', '美食广场', '餐饮广场', '西餐厅'}},
    '咖啡馆': {'.': types.tags_NO, '-': {},
               '+': {'茶艺居', '茶艺店', '茶艺苑', '茶艺馆', '茶饮店', '茶饮坊', '茶叶店', '茶庄行', '茗茶轩', '茶饮室', '茶艺坊', '茶艺室', '咖啡厅', '茶坊店', '饮水店', }},
    '茶馆': {'.': types.tags_NO, '-': {},
             '+': {'茶楼', '茶座', '茶都', '茶莊', '茶居', '茶荘', '茶庄', '茶轩', '茶舫', "茶室", '饮舍', "饮吧", "奶店", '茶舍', '网吧', '网咖', "味馆", '茶社', '茶店', "奶吧", "水吧", }},
    '农家宴': {'.': types.tags_NO, '-': {'宴席', '宴会', '宴请'},
               '+': {'全猪宴', '渔家宴', '藏家宴', '饺子宴', '全羊宴', '食宴', '豆腐宴', '鸽宴'}},
    '饭庄': {'.': types.tags_NO, '-': {},
             '+': {'面莊', '饭莊', '鱼莊', '羊肉府', '美食府', '食府', '美食荟', '美食都', '干锅居', '火锅居', '砂锅居', '美食居', '饺子居', "饭堂", '副食部', '餐饮部', '蛋糕店', "包子铺",
                   '美食林', '麻辣烫店', '粥荘', '食荘', '饭荘', '鱼荘', '面荘', '食庄', '食莊', '豆花庄', '面庄', '面馆', '鲜味渔庄', '渔家庄', '渔庄', '烤羊庄', '羊庄', "馕店", "鱼店",
                   '汤馆', '粉馆', '肉馆', '鱼馆', '饼家', '鱼庄', '馍房', "烤吧", "饼屋", "串店", "汤店", '粮店', '油店', '粉店', '肉店', '菜店', '面店', '鸡店', '鸭店', "果行",
                   '炖鱼村', '江鱼村', '火锅村', '烙馍村', '美食村', '莜面村', '饺子村', "餐部", "餐饮馆", '肥牛城', "馍店", "米店", "食坊", '庄园', '快餐', '饼店', '酒家', '农庄', '鱼府', }},
    '酒庄': {'.': types.tags_NO, '-': {},
             '+': {'酒馆', '酒都', '酒廊', '美酒荟', '红酒庄', '酒肆', '酒池', '酒荘', '酒水店', '酒莊'}},

    # '酒馆': {'.': types.tags_NO, '-': {}, '+': {}},

    '海鲜舫': {'.': types.tags_NM, '-': {},
               '+': {'海鲜鲂', '河鲜舫', '湖鲜舫', '蟹舫', '夜宵舫'}},
    '小吃店': {'.': types.tags_NM, '-': {},
               '+': {'小饭桌', '小餐桌', '小吃坊', '小吃亭', '小吃城', '快餐城', '海鲜城', '小吃屋'}},
    '食品店': {'.': types.tags_NM, '-': {},
               '+': {'新鲜屋', '甜品店', '饮品店', '汉堡店', '包子店', '水果店', '蛋糕房', '食品门市', "甜品站", '海鲜港', '南食店', '食品城', '饺子城', '中心粮店', '美食花园', '啤酒花园',
                     '副食超市', "馒头店", "鸡排店", "冰淇淋店", "糕点店", "烘焙店", "凉皮店", "果蔬店", "水饺店", "面包坊", "蛋糕坊", "豆腐坊", "鸭脖店", "豆腐店", "披萨店",
                     "火烧店", "鲜果店", "饮料店", "调料店", "点心店", "饺子店", "寿司店", "卤味店", "果品店", "小炒店", "面皮店", "砂锅店", "馄饨店", "海鲜店", "生鲜店", "面包房",
                     }},
    # 旅游住宿
    '旅行社': {'.': types.tags_NM, '-': {},
               '+': {'中国旅行社', '假日旅行社', '假期旅行社', '国际旅行社', }},
    '宾馆': {'.': types.tags_NM, '-': {},
             '+': {'商务宾馆', '旅馆', '会馆', '酒店', '大酒店', '旅店', '招待所', '客栈', '度假村', '度假邨', '旅社', '客舍', '宾舍', '旅舍', '青年旅舍', '火车站旅馆', '火车站宾馆', '中心酒店', '连锁酒店'}},
    '民宿': {'.': types.tags_NO, '-': {},
             '+': {'公寓', '居士林', '蒙古大营', '傣家园', '残疾人之家', '老年公寓', '商务公寓', '渡假村', '温泉村', '山水庄', '渔家乐', '民宿店', '农家院',
                   '农家乐', '牧家乐', '林家乐', '农家小院', '农家庭院', '休闲庄', '农家庄', '农家饭庄', '休闲村', '儿童村', '博览村', '娱乐村', '文化村', }},
    '寺院': {'.': types.tags_NO, '-': {},
             '+': {'洞召', '清真寺', '佛堂', '佛寺', '佛禅寺', '古寺', '圆通寺', '地藏寺', '大寺', '女寺', '宁禅寺', '少林寺', '广福寺', '普济寺', '清凉寺', '清真女寺', '观音寺', '龙泉寺', '中寺', '禅寺'}},
    '教会': {'.': types.tags_NO, '-': {},
             '+': {'天主堂', '教堂', '天主教下会点', '天主教公所', '天主教堂', '佛教固定场所', '天主教活动场所', '佛教活动场所', '基督教活动场所', '基督教固定活动场所', '基督教活动固定场所',
                   '基督教场所', '祈祷所', '爱国会', '三自爱国会', '基督教青年会', '教区', }},
    # 洗浴会所
    '浴池': {'.': types.tags_NO, '-': {},
             '+': {'康浴园', '浴部', '泉浴城', '浴场', '浴室', '浴宫', '浴池店', '浴池部', '浴苑', '浴都', '淋浴厅', '淋浴店', '休闲池', '药池', "浴馆", '洗浴广场'}},
    '游泳池': {'.': types.tags_NM, '-': {},
               '+': {'游泳场', '游泳跳水馆', '游泳馆'}},
    '会所': {'.': types.tags_NO, '-': {},
             '+': {'美容会所', '养生会所', '休养所', "保健所", }},
    '俱乐部': {'.': types.tags_NM, '-': {},
               '+': {'足球俱乐部', '体育俱乐部', '青少年体育俱乐部', '健身俱乐部', '棋牌室', '舞厅', '歌舞厅', '歌厅', '地带', '骑行者之家', '休闲汇', '娱乐汇', '音乐汇', '渔排垂钓', '娱乐广场', '休闲广场', }},
    '理发店': {'.': types.tags_NO, '-': {},
               '+': {'美发店', '美甲店', '美容店', '按摩店', '足浴店', '美容馆', '养生馆', "理发室", "发艺店", "养生店", "足疗店", "造型店", "美体店", "保健馆", "服务馆", "健身馆", "按摩馆", "理疗馆", '美发城'}},
    '发室': {'.': types.tags_NO, '-': {},
             '+': {"发屋", '发厅', '发廊', '发舍', '香舍', }},

    # 商业销售
    '商店': {'.': types.tags_NM, '-': {'店内', '门市内', '市面'},
             '+': {'总店', "专属代理店", '平价综合商店', '直营店', '中心超市', '平价菜铺', '平价商店', '水果超市', '总代理', '食品超市', '中心门店', '用品门市', '销售门市', '器材门市', '建材门市', '通讯门市',
                   '收购门市', '生资门市', '超市', '平价超市', '便利超市', '用品超市', '便民超市', '生活超市', '百货超市', '烟酒超市', '连锁超市', }},

    '五金店': {'.': types.tags_NO, '-': {},
               '+': {'艺品店', '生活馆', "家电店", '饰品店', "钢材店", "水泥店", "卫浴店", "宠物店", "理疗店", "瓷砖店", "护肤店", '傢俬店', '家俬店', '仓储店', "美妆店", "孕婴店", "装修店", "保健店", "工具店",
                     "洁具店", "皮具店", "杂品店", "阳光店", "婚庆店", "推拿店", "涂料店", "水暖店", "烟杂店", '维修店', '配件店', '文具店', '玩具店', '服务店', '广告店', '批零部', '门窗店', '内衣店', '女装店',
                     '童装店', '服饰店', "体验店", "小卖铺", "补胎店", "花艺店", "制衣店", "寿衣店", "电讯店", "租赁店", "首饰店", "耗材店", '器材店', '建材店', '眼镜店', '装饰店', '手机店', '材料店', '科技店',
                     '电器店', '加工店', "玉器店", "花圈店", '通讯店', '农资店', '电脑店', '产品店', '经营店', '妆品店', '批发店', '特产店', '小卖店', "双代店", '零售店', '经销店', '销售店', '加盟店', '旗舰店',
                     "代理店", '小超市', '便民店', '形象店', '普通店', '经营坊', "精品屋", '专门店', '专营店', '专业店', '精品店', '用品店', '便利店', "专卖店", "收购店", "代销店", "分销店", "直销店", "门业店",
                     "电动车店", "护肤品店", "不锈钢店", '综合门市', '日用品店', '化妆品店', }},

    '坊店': {'.': types.tags_NO, '-': {},
             '+': {'金店', '花店', '包店', '锁店', "花坊", '货店', "布店", '之家', '花舍', '衣舍', '鞋店', '门市', '名店', '支店', '阁店', '书店', '鞋荘', "商社", '中心店',
                   "道馆", '书屋', '沙龙', '门店', '花苑', "表店", '专档', "煤店", "网店", '卖店', "专店", }},
    # 地标店铺
    '万达店': {'.': types.tags_NO, '-': {},
               '+': {'火车站超市', '超市店', '中心文具店', '中学店', "小学店", "小区店", "国际店", '商贸区店', '少年宫园', '少年宫店', '市政府园', '豪宅店', '华润店', '华能店', '中铁店', '中建店', '师专店', '师大店'}},

    '图书店': {'.': types.tags_NM, '-': {},
               '+': {'新华书店', '小学书店', '中学书店', '高中书店', '大学书店', '技校书店', '机场书店', '广场书店', '学院校园书店', '职院校园书店', '卫院校园书店', '学校校园书店',
                     '校园书店', '中心校校园书店', '小学校园书店', '中学校园书店', '校区校园书店', '高中校园书店', '初中校园书店', '职中校园书店', '连锁书店'}},
    '商贸行': {'.': types.tags_NO, '-': {},
               '+': {'寄卖行', '拍卖行', '电器行', '典当行', '贸易行', '电脑行', '通讯行', '租赁行', '装饰行', '批发行', '量贩', '加油港', '新干线汽车港', '鲜花港', "家居馆",
                     }},
    '商贸城': {'.': types.tags_NO, '-': {},
               '+': {'娱乐城', '家具城', '电器城', '不夜城', '电子城', '生态城', '科技城', '家电城', '家私城', '电脑城', '汽车城', '美食城', '装饰城', '自行车城', "家俱城", "鞋城", '电信城', '通信城',
                     '傢俬城', '家俬城', '批发城', '厨卫城', '建材城', '钢琴城', '五金机电城', '材料城', '家纺城', '布艺城', '洗车城', '五金城', '眼镜城', '商业城', '电料城', '贸易城', '商城', '商厦',
                     '商场店', '市场店', '广场店', '中心广场店', '机场店', '飞机场店', '体育场店', '商贸城店', '锁城店', '加油城', '大商场'}},
    '商场': {'.': types.tags_NM, '-': {},
             '+': {'购物广场', '商业大厦', '商埸', "展场", "家具广场", "商业广场", '通信广场', '家俬广场', '家居卖场', '家居名品馆', '家居广场', '鞋服广场', '手机广场', '生活广场', '家电广场', '数码广场', '家私广场',
                   '电脑广场', '家俱广场', '服务广场', '电器广场', '美容广场', '时尚广场', '摄影广场', '科技广场', '羽绒服广场', '通讯广场', '服饰广场', '灯饰广场', '装饰广场', }},
    '市场': {'.': types.tags_NM, '-': {'市场管理', '市场监督'},
             '+': {'批发市场', '综合市场', '交易市场', '农贸市场', '大市场', '商业大都市', '花鸟鱼市', '市埸', }},
    '百货店': {'.': types.tags_NM, '-': {},
               '+': {'百货商店', '百货商场', '百货大楼', '百货广场', '百货门市', '百货商行', '百货馆', '百货铺', '百货部', '百货行', '百货档', '百货楼', '百货汇', '百货名汇', '百货坊', '百货城', '百货屋', '百货床'}},
    '连锁店': {'.': types.tags_NO, '-': {'连锁经营'},
               '+': {'农资连锁', '服务连锁', '母婴连锁', '手机连锁', '农资连锁', '连锁商亭', '连锁经销部', '连锁配送部', '连锁经营部', '连锁销售点', '连锁机构'}},

    "商亭": {'.': types.tags_NO, '-': {},
             '+': {"服务亭", '文具亭', '零售亭', '销售亭', '食品亭', '售卖亭', '咖啡亭', '饮料亭', '售货机亭', '水果亭', '便民亭', '售货亭', '百货亭', '小百货亭', '冷饮亭', '餐饮亭'}},
    '商号': {'.': types.tags_NO, '-': {'号角', '号手', '号声'},
             '+': {'菜市场', '南货号', '山茶号', '自行车号', '仓买', '商行', '盐仓', '琴行', '茶行', '酒行', '金行', "漆店", "鞋行", "烟店", "布行", '柜台', '专柜', '药柜', '码头店', '书城', '卖场', '商都', '商城店', }},
    "制品店": {'.': types.tags_NO, '-': {},
               '+': {'名酒汇', '美食汇', '大全', '大全店', '总汇店', "玻璃店", "陶瓷店", "数码店", "家私店", '劳保店', '办公店', "烟花爆竹店", "家纺店", "裁缝店", "商贸店", "汽配店", "轮胎店", "时装店", "男装店",
                     "设计店",
                     "水产店", "文体店", "制作店", "通信店", "汽修店", '芳叔店', '胡同店', '五交化店', "家俱店", "厨具店", "渔具店", "灯具店", "日化店", "灯饰店", "花卉店", "综合店", "保健品店",
                     "礼品店", "设备店", "母婴店", "家居店", "珠宝店", "南杂店", '校园店', '五金交化店', "石材店", "水洗店", "装潢店", "修理行", "眼镜行", "维修行", "珠宝行", "建材行", '花园店', '花圃店', '苗圃店',
                     '基地店', '农场店', '大学店', '居然之家店', '公寓店', '书屋店', '供应店', '京东店'}},
    '代办柜': {'.': types.tags_NO, '-': {'柜子'},
               '+': {'业务柜', '服务柜', '专卖柜', '副食柜', '肉食柜', '服饰柜'}},
    '摊床': {'.': types.tags_NO, '-': {},
             '+': {'干调床', "肉摊床", "肉档", "菜摊床", "蔬菜摊床", '果蔬摊床', "菜档", "粥铺", "肉铺", }},
    # 邮政
    '邮局': {'.': types.tags_NM, '-': {},
             '+': {'邮政一站通', '邮政所', '邮政局', '邮政支局', '电信局', '电报局', '驿站', '邮政港', '驿栈', '火车站邮政支局', '火车站邮政所', '邮电局'}},
    '报刊亭': {'.': types.tags_NO, '-': {'亭子'},
               '+': {'报亭', "电话亭", '书报亭', '邮政亭', '公话亭'}},
    # 交通运输仓储
    '车务段': {'.': types.tags_NO, '-': {'段落'},
               '+': {'房产段', '通信段', '大修段', '检修段', '维修段', '工务段', '服务段', '机务段', '电务段', '综合段', '房建公寓段', '房产公寓段', '施工段', '桥工段', '供应段', '房建段',
                     '养护段', '材料段', '基础设施段', '工务机械段', '供水段', '生活段', '轮渡段', '管理段', '公路管理段', '运用段', '供电段', '工电段', '水电段', '工程段', '建筑段',
                     '技能训练段', '多种经营段', '公路段', '养路段', '动车段', '客车段', '焊轨段', '机辆段', '车辆段', '铁路运输段', '客运段', '航道段', '修防段', '总段', '维管段', }},
    '装卸码头': {'.': types.tags_NM, '-': {},
                 '+': {'客运主枢纽', '航电枢纽', '重件码头', '服务码头', '渔港监督', '粮港', '公铁联运港', '农垦货运港'}},
    '火车站': {'.': types.tags_NO, '-': {},
               '+': {'汽车站', '中心站', '汽车客运站', '客运站', '铁路专用线', '枢纽台', '发运站台', "中转站", "运输站", "储运站", "货运站", "转运站", "收费站", "配送站", "收储站", '铁路港'}},
    '总站': {'.': types.tags_NO, '-': {''},
             '+': {'车站', '东站', '北站', '南站', '西站', "货站", '站台', '码头', '货仓', '分段', }},
    '货运部': {'.': types.tags_NO, '-': {},
               '+': {'物资部', '运输部', '配送部', '发行部', '汽车队', '运输队', '机修班', '汽车班', '运输班', "托运部", "物流部", }},
    '仓库': {'.': types.tags_NO, '-': {'库内', '库存', '库中'},
             '+': {'储备库', '粮食储备库', '直属库', '粮库', '仓储部', '仓储场', '仓储站', '粮站', '资料仓', '配送仓', '供应仓', '保税仓', '保管仓', '前置仓', '副食仓', '化肥仓', '工艺仓', '布仓',
                   '批发仓', '批发货仓', '物资仓', '监管仓', '肥料仓', '中心库', '(配送)库', '中转库', '仓储库', '供应总库', '保税库', '保鲜库', '储备库', '储藏库', '米粮库', '中心粮库',
                   '冷库', '冷藏库', '冻库', '分库', '化肥库', '器材库', '购销库', '寄售库', '总库', '恒温库', '收储库', '收纳库', '果品库', '气瓶库', '沥青库', '油库', '油脂库', '物资库', '中心储备粮库',
                   '储运库', '直管库', '石油气库', '糖库', '装备库', '配送库', '仓储栈', '储运栈', '转运栈', '煤栈', '货栈', '贸易栈', '贸易货栈', '暖车库', '车库', '保管场', '中心仓库', '库区', }},
    # 小微运输业
    '运输户': {'.': types.tags_NO, '-': {},
               '+': {'客运户', '货运户', '贩运户', '输运户', '搬运户', '营运户'}},

    # 常见机关:局/所/处
    '管理局': {'.': types.tags_NM, '-': {},
               '+': {'农业局', '林业局', '电业局', '工作局', '商务局', '水利局', '规划局', '城乡规划局', '信息化局', '矿务局', '水务局', '服务局', '就业服务局', '环境局', '财政局',
                     '生态环境局', '招商局', '开发局', '草原局', '林业和草原局', '兽医局', '畜牧兽医局', '发展局', '经济发展局', '健康局', '卫生健康局', '保障局', '社会保障局',
                     '地震局', '粮食局', '改革局', '发展和改革局', '运输局', '交通运输局', '促进局', '交通局', '干部局', '老干部局', '信访局', '气象局', '铁路局', '公路局', '中心局',
                     '教育局', '计划生育局', '机要局', '电视局', '广播电视局', '统计局', '建设局', '城乡建设局', '规划建设局', '税务局', '国家税务局', '地方税务局', '税务总局', '工程局', '体育局',
                     '教育和体育局', '档案局', '出版局', '新闻出版局', '检疫局', '检验检疫局', "事业局", "海事局", "水产局", "物价局", "合作局", "振兴局", "乡村振兴局", '民政局', '科学技术局',
                     "储备局", "移民局", "广电局", "保险局", "林草局", '事务局', '事务管理局', '城市管理局', '应急管理局', '石油管理局', '监督管理局', '工程管理局', '建设管理局', '公路管理局', '运输管理局',
                     '总局', '审批局', '行政审批局', '环境保护局', '科技局', '保护局', '环保局', '农村局', '农业农村局', '资源局', '国土资源局', '卫生局', '旅游局', '综合执法局',
                     '行政执法局', '执法局', '稽查局', '监督局', "管局", "监管局", "就业局", "渔业局", "海洋与渔业局", "通信局", "河务局", "保密局", "机要保密局", "水土保持局", "知识产权局",
                     "园林局", "勘测局", "能源局", "农牧局", "畜牧局", "文物局", '(体育)局', '(侨务)局', '(农林水利)局', '(文化)局', '(新闻出版)局', '(水务)局', '(版权)局',
                     '(综合执法)局', '(综合行政执法)局', '(质量技术监督)局'}},
    '管理所': {'.': types.tags_NM, '-': {},
               '+': {'资源管理所', '工程管理所', '建设管理所', '公路管理所', '运输管理所', '交通管理所', '保管所', '城管所', '房管所', '托管所', '水管所', '监管所', '粮管所', '劳动保障所',
                     '运管所', '管所', '中心所', '财政所', '资源所', '国土资源所', '自然资源所', "干休所", "电信所", "水利所", "税务所", "环卫所", "工商所", "国土所", "保护所", '草原监理所',
                     "民政所", "执法所", "邮电所", "科研所", "财税所", "粮所", "测绘所", "教育所", "收费所", '环保土地所', '物价检查所', '动物监督所', }},
    '管理处': {'.': types.tags_NM, '-': {},
               '+': {'物业管理处', '园林管理处', '工程管理处', '建设管理处', '公路管理处', "秘书处", "海事处", "筹建处", '中心管理处', '协调处'}},
    '服务处': {'.': types.tags_NM, '-': {},
               '+': {'工程处', '建筑工程处', '安装工程处', '联络处', '经营处', '代表处', '登记处', '婚姻登记处', '公证处', "报名处", "施工处", "供应处", "接待处", "维修处", "代售处", "代理处",
                     "安装处", "租赁处", "分销处", "购销处", }},
    '专业署': {'.': types.tags_NM, '-': {},
               '+': {'住房保障署', '促进署', '保障署', '公平贸易促进署', '出版总署', '分署', '管理署', '城市管理署', '审计署', '建筑工务署', '开发建设署', '开发署',
                     '投资推广署', '服务署', '水务署', '行政公署', '责任审计专业署'}},
    '营业所': {'.': types.tags_NM, '-': {},
               '+': {'事务所', '律师事务所', '工程师事务所', '会计师事务所', '会师事务所', '交易所', '产权交易所', "营业处", "售楼处", "直销处", "保障所", "规划所", "监理所", "测试所", }},
    # 服务厅站
    '管理站': {'.': types.tags_NO, '-': {},
               '+': {'管理总站', '检查站', '边防检查站', '植检站', '植保植检站', '检测站', '监测站', '环境监测站', '水利管理站', '救助管理站', '监督管理站', '工程管理站', '建设管理站',
                     '公路管理站', '检疫站', '监督站', '质量监督站', '防火站', "防疫站", "安监站", "统计站", "保护站", "防治站", "监理站", "检验站", '水利工作站', '消防工作站', '种苗管理站', '种子管理站',
                     '交通管理站', '农机服务站', '价格监督站', '文化体育站', '农药管理站', '植物检疫站', '水利农机站', '渔业管理站', '渔政管理站', '草原监理站', '船舶管理站', '农机管理站', }},
    '供应站': {'.': types.tags_NO, '-': {},
               '+': {'食品站', '推广站', '技术推广站', '液化气供应站', '军粮供应站', '采购供应站', '物资供应站', '技术推广总站', '气站', '液化气站', }},
    '服务站': {'.': types.tags_NO, '-': {},
               '+': {'工作站', '维修站', '汽车维修站', '劳动服务站', '文化站', "批发站", "建设站", "采购站", "物资站", "试验站", "指导站", "搅拌站", "经营站", "经销站", "军供站", "保健站", '气象观测站',
                     "妇幼保健站", "救助站", "供热站", "修理站", "护理站", "仪器站", "接待站", "水土保持站", "交流站", '林业工作站', '动物防疫站', '文物保护站', '竹木检查站', '预防保健站', '街道统计站',
                     '服务区', '服务区北区', '服务区南区', '服务区东区', '服务区西区', '停车区', '停车区东区', '停车区南区', '停车区西区', '停车区北区', }},
    '营业厅': {'.': types.tags_NO, '-': {},
               '+': {'服务厅', '展示厅', '营业班', '营销班', '火车站营业厅', '总营业厅'}},

    # 业务部门
    '技术部': {'.': types.tags_NM, '-': {},
               '+': {'工程部', '装饰工程部', '安装部', '设计部', '培训部', '通讯部', '咨询部', '开发部', }},
    '服务部': {'.': types.tags_NO, '-': {},
               '+': {'维修服务部', '技术服务部', '咨询服务部', '广告部', '摄影部', '信息部', '服务房', "生产部", "装修部", "策划部", "综合部", "商品部", "发展部", "材料部", "器材部", "电焊部",
                     "电脑部", "编辑部", '图文部', "财务部", "项目部"}},
    '管理部': {'.': types.tags_NM, '-': {},
               '+': {'宣传部', '武装部', '监理部', '经理部', '组织部', '水利部', '统战部', '科技部', '指挥部', }},
    '修理部': {'.': types.tags_NO, '-': {},
               '+': {'维修部', '电器维修部', '家电维修部', '汽车维修部', '汽车修理部', '汽修部', }},
    '供应部': {'.': types.tags_NO, '-': {},
               '+': {'收购部', '商贸部', '租赁部', '生资部', '贸易部', '售楼部', '事业部', '代理部', '业务部'}},
    '加工部': {'.': types.tags_NM, '-': {},
               '+': {'制作部', '装潢部', '装璜部', '建材部', '配件部', '装饰部', '广告装饰部', '工作部'}},
    '工作室': {'.': types.tags_NM, '-': {},
               '+': {'制作工作室', '设计工作室', '实验室', '设计室', '中心试验室', "试验室", '中心实验室', '中心化验室'}},

    # 业务科室队
    '业务科': {'.': types.tags_NO, '-': {},
               '+': {'农业科', '文化科', '装备科', '器械科', '机械科', '检测科', '交通科', '基建连', '基建处', '基建科', "督导室", "教研室", "督查室", "档案室", }},
    '消防队': {'.': types.tags_NM, '-': {},
               '+': {'救援队', '稽查队', '调查队', '执法队', '专职消防队', '总队', }},
    '服务队': {'.': types.tags_NO, '-': {},
               '+': {'维修队', '劳务队', '装卸队', '施工队', '工程队', '土石方工程队', '建筑工程队', '建筑队', '测绘队', '修缮队', '安装队', '设计队', '养护队', '城调队', '农业队', '林业调查队',
                     '救护队', "专业队", "工作队", "绿化队", "监察队", "搬运队", "测量队", '生产队', '牧业队', '林业队', '井队', '车队', '火车站装卸队'}},
    '服务点': {'.': types.tags_NO, '-': {},
               '+': {'代办点', '代售点', '销售点', '零售点', '供应点', '网点', '收购点', '护林哨', '机动车检测线', '收购线', '检测线', "营业点", "加工点", '收购专点',
                     "代理点", "配送点", "代销点", "直销点", "经销点", "活动室", "游戏室", "招生点", "经营点", "报名点", "教学点", "库点", "供气点", "加油点", "经营场"}},

    # 农牧业
    "鱼场": {'.': types.tags_NM, '-': {},
             '+': {'渔塘', '鱼池', '渔港', '养殖基池', '养鱼池', '养鱼塘', "渔场", '鱼塘', '鱼苗场', '鱼原种场', '水产渔场', '鱼苗鱼种场', '鱼种场', '水产试验场', '猪场', '羊场', '马场', '鸡场', '犬舍',
                   '猫舍', '鸽舍', '鸽场', '鳗场', '畜场', '茶场', '菜场', '花圃', '苗圃', '茶园', '果园', '果场', '苗场', }},
    '种植场': {'.': types.tags_NM, '-': {},
               '+': {'种植园', '农场', '木场', '林场', '花木场', '竹木场', '农作物种植场', "实验农场", '中心苗圃', '作物场', '示范场', '种植专场',
                     '苗木基地', '种植基地', '植物园', '苗圃场', '花木园', '国有林场', '园艺场', '绿化园', '农业园', '花卉园', '生态园', '核桃园', '樱桃园', '农作物原种场', '中心林场', '樱花园',
                     '养殖地', '橡胶地', '种植地', '林埸', '种植示范小区', '营林区', "发展场", "农林发展场", "农业发展场", "蔬菜发展场", '示范农场', '经营林场', '实验林场', '林业场', '兰花园',
                     '水果场', '果林场', '育苗场', '经济作物示范场', '柑桔场', '农垦场', '机械林场', '国营林场', '试验林场', '造林场',
                     '防护林场', '茶林场', '园林场', '良种场', '果苗良种场', '示范繁殖农场', '繁殖农场', '林木良种场', '林业总场', '茶叶实验场', '果园场',
                     '桔场', '茶叶示范场', '园艺试验场', '林木场', '农业场', '花卉繁殖场', '果树繁殖场', '良桑繁殖场', '原种繁殖场', '种籽繁殖场', '苗种繁殖场', '园艺繁殖场',
                     '农特场', '林特场', '农业示范场', '种养示范场', '开发示范场', '栽培示范场', '生态示范场', '科技示范场', '果树示范场', '柑桔示范场', '良种示范场', '林特示范场', '园艺示范场', '试验示范场',
                     '农业试验场', '综合试验场', '果树试验场', '良种试验场', '种苗试验场', '育苗试验场', '林草试验场', '种植区', '芦苇场', '采育场', '储木场', '养植场', '培植场',
                     }},
    '养殖场': {'.': types.tags_NM, '-': {},
               '+': {'养殖基地', '水产养殖场', '猪养殖场', '生猪养殖场', '垦殖场', '牧场', '原种场', '养殖埸', '养殖总埸', '养殖总场', '农牧场', '种羊场', '水产场', '山羊场',
                     '养殖小区', '养猪小区', '牧业小区', '养殖舍', "种养场", "饲养场", "繁育场", "畜牧发展场", "肉牛发展场", "养殖发展场", "种猪场", '奶山羊场',
                     '黄牛良种繁育场', '良种繁育场', '畜牧场', '绵羊育种场', '种畜场', '山羊选育场', '选育场', '畜禽良种场', '畜牧农场', '林牧场', '畜牧良种场', '良繁场', '驯养繁殖场',
                     '训养繁殖场', '奶牛繁殖场', '种牛繁殖场', '肉牛繁殖场', '动物繁殖场', '仔猪繁殖场', '生猪繁殖场', '种猪繁殖场', '种畜繁殖场', '渔种繁殖场', '良种繁殖场', '鱼种繁殖场', '种苗繁殖场', '鱼苗繁殖场',
                     '示范繁殖场', '龟蛙繁殖场', '山鸡繁殖场', '繁殖场', '养牛场', '奶牛场', '种牛场', '肉牛场', '育肥牛场', '孵禽场', '养狗场', '守猎场', '苗禽场', '养殖示范场', '育肥示范场', '养殖经营场',
                     '养蚕场', '养殖试验场', '增养殖试验场', '种养殖试验场', '畜牧试验场', '养龟场', '种鳖场', '畜禽试验场', '种猪试验场', '鱼种试验场', '种马场', '种蜂场', }},
    '肥药站': {'.': types.tags_NM, '-': {},
               '+': {'肥药部', '肥药店', '农药店', '农药部', '农药门市', '兽药部', '兽药行', '兽药店', '农药站', '兽药站', '农药铺', "农家店", "种子店", "化肥店", "购销店",
                     "土肥站", "种苗站", "烟草站", "烟站", "烟叶站", "植保站", '林业站', "农技站", "水产站", "种子站", "茧站", '兽医站', '畜牧兽医站', "农资部",
                     }},
    '水库': {'.': types.tags_NM, '-': {},
             '+': {'水站', '翻水站', '扬水站', '供水站', '水利站', "水务站", '抽水站', '电排站', '供水场', '淡水场', '加水场', }},

    # 前导冠字
    '中华人民共和国': {'.': types.tags_NZ, '-': {},
                       '+': {'中国共产党', '共产党', '中国共青团', '共青团', '中国人民解放军', '中国人民武装警察部队', '中国人民武警部队', '中国人民政治协商会议', '中国人民政协', '中国教育工会', '中国金融工会',
                             '中国铁路工会', '中国海员工会', '中国煤矿工会', '中国邮电工会', '中国民航工会', '中国财贸工会', '中国建筑工会', '中国交易工会', '中国联通工会', }},

    # 地区/方位
    '中央': {'.': types.tags_NS, '-': {},
             '+': {'苏木', '嘎查', '嘎查村', '苏木村', '中心村', '苏木乡', '自治县', '自治州', '自治旗', '自治区', '民族乡', '新村', '古村', '民族苏木', '广场', '县城', '东西', '南北', '西南', '西北',
                   '华北', '东北', '华东', '华中', '华南', '大街', '支路', '大道', '东路', '西路', '南路', '北路', '中路', '以东', '以西', '以南', '以北', '中南', '东南', }},
    '中部': {'.': types.tags_NA, '-': {},
             '+': {'东部', '西部', '南部', '北部', '公司村', '/', '-', '、', }},

    # 开发区/地区/园区
    '地区': {'.': types.tags_NS3, '-': {},
             '+': {'开发区', '新区', '创新区', '托管区', '保护区', '经开区', '管区', '保护开发区', '保税区', '边境经济合作区', '产业集聚区', '经发区', '产能区', '综合区', '合作示范区',
                   '多功能配套区', '纺织工业聚集区', '食品工业聚集区', '改革示范区', '高技区', '高新技术产业开发区', '高新开发区', '高新区', '高新实用技术开发区', '产业示范区', '创新示范区', '生态工贸区',
                   '工矿区', '工贸区', '工业发展区', '工业集聚区', '工业集中区', '工业聚集区', '工业开发区', '工业区', '工业转型试验区', '工业综合开发区', '公安管区', '沿海经济区', '临港产业区', '综合试验核心区',
                   '国际合作示范区', '国际物流区', '国家高新区', '国家自主创新示范区', '海港经济开发区', '海洋经济开发区', '航空物流区', '高新技术产业示范区', '产业经济开发区', '产业聚集区',
                   '合作经济开发区', '合作区', '互市贸易区', '国际贸易区', '华侨经济开发区', '华侨经济区', '华侨投资区', '化工集中区', '火炬高技术开发区', '技术经济开发区', '建设区', '经济合作区',
                   '经济技术开发区', '经济开发区', '经济开发试验区', '经济开发新区', '经济贸易开发区', '经济区', '经济特区', '经济综合实验区', '军区', '军分区', '开发分区', '开放开发区', '科技经济开发区',
                   '跨境工业区', '老工业区', '临港商务区', '贸易开发区', '民营经济发展区', '民营经济开发区', '新兴产业集中区', '产业集中区', '现代农业示范区', '商品经营开发区', '新经济产业集聚区',
                   '民营区', '农业高新区', '农业经济开发区', '农业开发区', '农业综合开发区', '汽车产业开发区', '商贸经济示范区', '商贸示范区', '商务区', '新兴技术开发区', '合作产业开发区', '国际商务区',
                   '生态经济开发区', '示范区', '特别合作区', '特区', '特色农业经济开发区', '外商投资工业区', '高技术产业开发区', '外向型农业开发区', '综改区', '发展区', '综保区', '农业高新技术开发区',
                   '稀土高新区', '现代产业区', '现代农业产业示范区', '高新技术开发区', '新技术开发区', '新建工业区', '循环工业发展区', '循环经济开发区', '沿海经济开发区', '生态综合开发区', '先进制造业开发区',
                   '沿海经济开发试验区', '移民区', '渔业管区', '中心城区', '城区', '中心区', '转型综合改革示范区', '自贸区', '自贸试验区', '自主创新示范区', '综合保税区', '综合经济开发区',
                   '综合开发区', '综合实验区', '城乡一体化示范区', '农业高新技术产业示范区', '现代畜牧业示范区', '畜牧业示范区', '工业转型集聚区', '中央商务区', '新兴工业集中区', '环城工业集中区',
                   '生态移民示范区', '新型工业化化工区', '农村牧区', '牧区', '边境经济技术合作区', '经济技术合作区', '新兴产业示范区', '易地扶贫搬迁安置区', '健康产业国际合作示范区', '滨海高新区',
                   '综合物流产业聚集区', '自由贸易试验区', '高新技术产业区', '特殊乡镇', '直属乡镇', '工贸集中区', '民营经济区', '农业高新技术示范区', '新经济区', '协同发展区', '产业开发区', '统筹发展试验区',
                   '商贸物流枢纽区', '投资区', '经技区', '航空区', '农高区', '科创区', '工业示范区', '新疆生产建设兵团', '中国(广东)自由贸易试验区', '中国(湖北)自由贸易试验区'}},
    '景区': {'.': types.tags_NS3, '-': {},
             '+': {'风景名胜区', '风景区', '名胜区', '名胜风景区', '旅游度假区', '旅游渡假区', '旅游经济开发区', '旅游景区', '旅游开发区', '温泉风景区', '温泉疗养旅游开发区',
                   '生态休闲旅游度假区', '滨海旅游度假区', '滑雪旅游度假区', '生态休闲区', '生态旅游度假区', '省级旅游度假区', '生态旅游建设示范区', '生态旅游示范区', '自然保护区', '度假区',
                   '滨海旅游渡假区', '省级生态旅游度假区', '渡假区', '国家级自然保护区', '省级自然保护区', '生态保护区', '生态示范区', '历史文化街区', '温泉新区',
                   '商业文化旅游中心区', '生态文化旅游示范区', '文化景区', '生态区', '国家旅游度假区'}},
    '园区': {'.': types.tags_NS4, '-': {},
             '+': {'片区', '分区', '中心片', '监区', '林区', '矿区', '厂区', '坝区', '煤区', '分灌区', '新片区', '示范片', '林场区', '居民区', '小区', '住宅区', '分蓄洪区', '蓄洪区', '洪泛区',
                   '保税港区', '航空港区', '核心港区', '港区', '港区域', '特别行政管理区', '农垦管理区', '华侨管理区', '经济管理区', '垦区', '围垦区', '资源区', '物业区', '空港区', '功能区', '警备区', '实验区', '安置区',
                   '生态管理区', '旅游区', '文化旅游区', '海湾旅游区', '生态文化旅游区', '风景旅游区', '生态旅游区', '边贸旅游区', '特别管理区', '风景名胜管理区', '旅游管理区', '港务区', '国际港务区', '金融商务区',
                   '科创园区', '福利园区', '中心园区', '交易园区', '中心商务区', '科技商务区', '专利技术园区', '高新技术园区',
                   '经济园区', '循环经济园区', '循环园区', '临空综合经济园区', '生态经济园区', '高科园区', '高新产业园区', '新产业园区', '新技术产业园区', '装备制造产业园区',
                   '高新技术产业园区', '循环经济产业园区', '示范小区', '微电子小区', '商务产业园区', '科技产业园区', '农机产业园区', '农业产业园区', '家纺产业园区', '国家农业园区', '教育产业园区',
                   '新型工业园区', '出口加工区', '高新园区', '能源化工园区', '轻工业园区', '经济工业园区', '科工贸园区', '深加工园区', '制造工业园区', '商务商贸街区', '化工园区', '临港化工园区', '临港物流园区',
                   '高科技园区', '新材料园区', '工业园管理区', '城市工业园区', '现代服务业园区', '外向型工业加工区', '国际物流加工区', '工业加工区', '酒业园区', '空港物流园区', '高教园区', '生态工业园区',
                   '新兴产业工业园区', '职业教育园区', '农副产品加工交易园区', '汽车园区', '低碳经济园区', '工片区', '风情区', '高开区', '经开园', '国际机场', '机场',
                   }},

    '社区': {'.': types.tags_NS5, '-': {},
             '+': {'街道', '集体资产社区', '组团虚拟社区', '直属社区', '直属虚拟社区', '虚拟社区', '虚拟生活区', '生活区', '类似社区', '联合小区', '产业社区', '工业社区', '类似乡级单位', '特殊社区',
                   '直辖村级区划', '新型农村社区', '中心社区', '虚拟劳管所', '类似村', '社区村', '农场村', '实验村', '渔场村', '林场村', '区块社区', '城市社区', '文化社区',
                   '火车站社区', '花园', '农场社区', '总场社区', '林场社区', '工业园小区', '直辖区', '辖区', '联办村', '南社区', '东社区', '西社区', '北社区'}},
    # 院校/加油站的南北区
    '办公区': {'.': types.tags_NS6, '-': {},
               '+': {'东区', '南区', '西区', '北区', '中区'}},
    '作业区': {'.': types.tags_NO, '-': {},
               '+': {'采区', '管护区', '管理区', '院区', '病区', '疗区', '灌区', '销售片区', '营销片区', '零售片区', '实验园区', '发展园区', '工业园区', '教育园区', '农业科技园区', '物流园区', '农业示范园区',
                     '畜牧业示范园区', '生态示范园区', '高科技示范园区', '科技示范园区', '技术实验园区', '扶贫产业园区', '育种园区', '国家农业科技园区', '储粮区', '科技园区', '文化科创园区', '社会福利园区',
                     '综合服务园区', '服务园区', '监管中心园区', '领工区', '加工区', '示范园区', '高新技术示范园区', '集中示范园区', '出口创汇示范园区', '商贸区', '游览区', '风景游览区', }},
    # 特殊区域尾缀的组织机构
    '马迹山港区': {'.': types.tags_NM, '-': {},
                   '+': {'鹤洲北垦区', '洪塘现代农业园区', '水莲花生态农业园区', '生态循环农业园区'}},

    '产业园': {'.': types.tags_NM, '-': {},
               '+': {'科技产业园', '科技创业园', '创业园', '工业园', '软件园', '环保科技园', '科技园', '示范园', '物流园', '发展园', '绿色产业园', '电子商务产业园', '高新技术产业园', '农业示范园', '信息园',
                     '畜牧业园区', '农牧业园区', '牧业园区', '农业园区', '产业园区', '创业园区', '信息园区', }},
    '游乐园': {'.': types.tags_NM, '-': {},
               '+': {'游乐场', '游乐城', '音乐城', '游乐苑', '森林公园', '动物园', '风景园', '娱乐湾', '赛马场', '骝马场', '走马场', '溜冰城', '旱冰城', '文化城', '动漫城', '中心广场', '旅游园区', }},
    '乐园': {'.': types.tags_NO, '-': {},
             '+': {'公园', }},

    # 高频单字尾缀,被排除的有: 科吧点厅行团房堂宫队社阁坊楼轩斋苑亭摊档会办屋组铺园室处场
    '厂': {'.': types.tags_NO, '-': {'厂房', '厂长', '厂内', '厂外', '间距', '间隔', '我厂'}, '+': {}},
    '店': {'.': types.tags_NO, '-': {}, '+': {'斋店', '果店', '食店', }},
    '部': {'.': types.tags_NO, '-': {'部门', '部长', '部分', '我部'}, '+': {}},
    '馆': {'.': types.tags_NO, '-': {'馆长', }, '+': {'公馆', "茶坊", '饭馆', '药堂', '小馆', '味斋'}},
    '所': {'.': types.tags_NO, '-': {'所长', '所以', '所得', '我所'}, '+': {'片区所'}},
    '局': {'.': types.tags_NO, '-': {'局长', '局部', '局座', '局域', '本局', '我局', '及局', '与局', '和局'}, '+': {'酒局'}},
    '矿': {'.': types.tags_NO, '-': {}, '+': {}},
    '城': {'.': types.tags_NO, '-': {'城墙', '城门', }, '+': {}},
    '站': {'.': types.tags_NO, '-': {}, '+': {}},
    '社': {'.': types.tags_NO, '-': {}, '+': {}},
    '院': {'.': types.tags_NO, '-': {'院长', '院方', '院子', '院内'}, '+': {}},
    '园': {'.': types.tags_NO, '-': {'园长', '园内', }, '+': {}},

    # 后置尾缀
    '(协会)': {'.': types.tags_NL, '-': {},
               '+': {'(商会)', '(总商会)'}},
    '(托养中心)': {'.': types.tags_NL, '-': {},
                   '+': {'(家庭农场)'}},
    '(普通合伙)': {'.': types.tags_NL, '-': {},
                   '+': {'(特殊合伙)', '(有限合伙)', '(特殊普通合伙)', '(有限合伙企业)', '(普通合伙企业)', '(特殊普通合伙企业)', '(股份合作制)', '(合伙企业)',
                         '(普通合作企业)', '(普通合伙微型企业)', '(社区服务业)', '(普通合伙人)', '(合伙)', '(有限责任合伙)', '(股份合作)', '(合作)', '(普通合作)'}},
    '(分支)': {'.': types.tags_NL, '-': {},
               '+': {'(普通合伙企业分支机构)', '(有限合伙企业分支机构)', '(有限合伙分支机构)', '(普通合伙分支机构)', '(普通合伙分支)', '(分支机构)', '(普通合作分支机构)'}},
    '(有限公司)': {'.': types.tags_NL, '-': {},
                   '+': {'(有限责任)', '(有限责任公司)', '(股份有限公司)', '(公司)', '(电子商务)', '(集团)', '(自然人独资)'}},
    '(微型企业)': {'.': types.tags_NL, '-': {},
                   '+': {'(个体工商户)', '(无字号名称)', '(个人独资)', '(个人独资企业)', '(个人独资分支机构)', '(个体)', '(个体户)', '(微企)', '(小微企业)', '(外商普通合伙)'}},
    '(字号加盟)': {'.': types.tags_NL, '-': {},
                   '+': {'(加盟)', '(字号已加盟)', '(个体加盟)', '(东区)', '(西区)', '(南区)', '(北区)', '(流动)', '(上线)', '(下线)', '(经纪人)', '(农牧区经纪人)', '(农村经纪人)', '(租赁经纪人)', '(社区服务)'}},
}


def is_tail_type(word, types):
    """判断word是否为types目标类别关键词.返回值:空串,不匹配;非空,匹配的目标类型"""
    if isinstance(types, str):
        types = [types]
    for type in types:
        if word == type:
            return type
        if type not in nt_tails:
            continue
        if word in nt_tails[type]['+']:
            return type
    return ''


def take_tails_by_type(type, with_ext=False):
    """按类型获取尾缀词表.返回值:{word:types}"""
    rst = {}
    for tn in nt_tails:
        typs = nt_tails[tn]['.']
        if not types.equ(typs, type):
            continue
        rst[tn] = typs

        if not with_ext:
            continue
        exts = nt_tails[tn]['+']
        for en in exts:  # 记录扩展词汇
            rst[en] = typs
    return rst


def make_tails_data(with_NO=False):
    """利用内置NT组份表构造{words:types}映射表"""
    rst = {}
    for tn in nt_tails:
        typs = deepcopy(nt_tails[tn]['.'])

        if with_NO and len(tn) == 1 and types.NO in typs:
            rst[tn] = typs  # 允许的情况下才记录单字尾缀自身

        exts = nt_tails[tn]['+']
        for en in exts:  # 记录扩展词汇
            assert en not in rst, en
            rst[en] = typs

        bads = nt_tails[tn]['-']
        for en in bads:  # 检查排斥词汇
            assert en not in rst, en
    return rst


def make_tails_nos():
    """内置NT组份表,构造NO单字尾缀集合"""
    rst = set()
    for tn in nt_tails:
        typs = nt_tails[tn]['.']
        if len(tn) == 1 and types.NO in typs:
            rst.add(tn)  # 允许的情况下才记录单字尾缀自身
    return rst


# 生成tail组份映射表
nt_tail_datas = make_tails_data()
# 生成tail单字尾缀集合
nt_tail_chars = make_tails_nos()


def drop_tail_by_type(txt, type={types.NM, types.NB, types.NL, types.NO}):
    """尝试丢弃txt中的已知尾缀"""

    def retry(line):
        for i in range(len(line)):
            t = line[i:]
            if t in nt_tail_datas and types.joint(nt_tail_datas[t], type):
                return line[:i]
            if t in nt_tails and types.joint(nt_tails[t]['.'], type):
                return line[:i]
        return line

    remain = retry(txt)
    while remain != txt:
        txt = remain
        remain = retry(txt)
    return remain


def query_tail_data(tail, with_NO=True):
    """查询指定的尾缀tail对应的组份类型信息.返回值:None或set(组份类型)"""
    if len(tail) == 1 and with_NO:
        return nt_tails.get(tail, None)
    return nt_tail_datas.get(tail, None)


def check_tail_type(tail):
    """按尾部特征尝试查询对应的组份类型.返回值:(tail匹配点,尾缀类型) 或 (None,None)"""
    for p in range(len(tail)):
        word = tail[p:]
        if word in nt_tail_datas:
            return p, nt_tail_datas[word]
        elif word in nt_tails:
            return p, nt_tails[word]['.']
    return None, None
